"""
hi how are you doing. This is pandas exercise for practice. You can sharpen your pandas existing knowlege withe best exercises. Thanks for attending

In [5]:
import pandas as pd

In [7]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['London', 'Manchester', 'Birmingham']
}
df = pd.DataFrame(data)
print(df)

      Name  Age        City
0    Alice   25      London
1      Bob   30  Manchester
2  Charlie   35  Birmingham

In [9]:
df.head()

      Name  Age        City
0    Alice   25      London
1      Bob   30  Manchester
2  Charlie   35  Birmingham

In [11]:
df.tail()

      Name  Age        City
0    Alice   25      London
1      Bob   30  Manchester
2  Charlie   35  Birmingham

In [15]:
df.shape

(3, 3)

In [17]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [21]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [23]:
## Select one column (returns a Series)
df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [25]:

# Select multiple columns (returns a DataFrame)

df[['Name', 'City']]

      Name        City
0    Alice      London
1      Bob  Manchester
2  Charlie  Birmingham

In [29]:
# Select a single row by index
df.iloc[0 # First row

Name     Alice
Age         25
City    London
Name: 0, dtype: object

In [31]:
df.iloc[-1 # Last row

Name       Charlie
Age             35
City    Birmingham
Name: 2, dtype: object

In [33]:
# Select a specific cell (row 0, column 1)
df.iloc[0, 1] # This should return 25 (Alice's age)

25

In [37]:

df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [39]:
df[['Name']]

      Name
0    Alice
1      Bob
2  Charlie

✅ df['Name'] → returns a Series (like a single column).

✅ df[['Name']] → returns a DataFrame (still one column, but keeps table format).

| Code            | What it does              |
| --------------- | ------------------------- |
| `df['Name']`    | One column as Series      |
| `df[['Name']]`  | One column as DataFrame   |
| `df.iloc[0]`    | First row as Series       |
| `df.iloc[0, 1]` | Cell at row 0, column 1   |
| `df.shape`      | (rows, columns)           |
| `df.describe()` | Stats for numeric columns |

🚦 Step 5: Filtering Rows with Conditions
Let’s say you want to find people older than 28.

In [50]:
df[df['Age'] > 28]

      Name  Age        City
1      Bob   30  Manchester
2  Charlie   35  Birmingham


### 🕵️ What does `df['Age'] > 28` return?

It returns something like this:

```python
0    False
1     True
2     True
Name: Age, dtype: bool
```

This is a **Boolean Series** — it checks each age:

* Is Alice (25) > 28? ❌ False
* Is Bob (30) > 28? ✅ True
* Is Charlie (35) > 28? ✅ True

Then `df[...]` keeps only the rows where the condition is `True`.

---

### 🧠 Quick Check:

If you run:

```python
df[df['City'] == 'London']
```

What do you think the output will be?

Try it in Jupyter, tell me what you see, and we’ll move on to modifying the DataFrame.

In [53]:
df[df['City'] == 'London']

    Name  Age    City
0  Alice   25  London

🔧 Step 6: Modifying Your DataFrame
Let’s learn how to:

Add a new column

Update values

Delete a column

In [66]:
# 1. Add a new column (everyone has the same value)
df['Country'] = 'UK'
df.head()

      Name  Age        City Country
0    Alice   25      London      UK
1      Bob   30  Manchester      UK
2  Charlie   35  Birmingham      UK

In [72]:
# 2. Update a single value (change Bob's age to 32)
df.loc[1, 'Age'] = 32
df.head()

      Name  Age        City Country
0    Alice   25      London      UK
1      Bob   32  Manchester      UK
2  Charlie   35  Birmingham      UK

In [80]:
# 3. Delete a column
df.drop('Country', axis=1, inplace=True)

KeyError: "['Country'] not found in axis"

In [82]:
df.head()

      Name  Age        City
0    Alice   25      London
1      Bob   32  Manchester
2  Charlie   35  Birmingham

axis=1 → means you're targeting a column

axis=0 → would target a row

inplace=True → means “do it directly on the original DataFrame (no need to assign it again)”

| Command                                    | What it does                                |
| ------------------------------------------ | ------------------------------------------- |
| `df['Country'] = 'UK'`                     | Adds a column named `'Country'` with `'UK'` |
| `df.loc[1, 'Age'] = 32`                    | Updates row 1, column `'Age'` to 32         |
| `df.drop('Country', axis=1, inplace=True)` | Deletes `'Country'` column directly         |

In [86]:
# Save to CSV
df.to_csv('my_data.csv', index=False)

In [88]:
new_df = pd.read_csv('my_data.csv')
print(new_df)

      Name  Age        City
0    Alice   25      London
1      Bob   32  Manchester
2  Charlie   35  Birmingham

In [90]:
print(new_df.equals(df))

True



### ✅ 1. What does `index=False` do?

Yes — you’re **mostly right**.

* By default, Pandas saves the **row index** (0, 1, 2,...) as an **extra column** in the CSV.
* When you use `index=False`, it **doesn’t** save that index column — it just saves the data as-is.

So your CSV stays clean and looks like:

```
Name,Age,City
Alice,25,London
Bob,32,Manchester
Charlie,35,Birmingham
```

---

### ✅ 2. Why might the new DataFrame not be “exactly” the same?

Small differences can happen:

* Data types might change slightly (`int` might become `float`).
* If `index=True` was used when saving, you'd get an extra column on load.
* But the **values** should match — try comparing with:

```python
print(new_df.equals(df))
```

---

In [95]:
Exam_data = {
    "Name": ["Ayaan", "Fatima", "Zayd", "Maryam", "Hamza" ],
    "Score": [85, 92, 76, 89, 67],
    "City": ["London", "Birmingham", "Manchester","London", "Leeds"]
}

In [103]:
df = pd.DataFrame(Exam_data)
'''
✅ Add a new column called "Passed":
Value should be 'Yes' if score ≥ 75, else 'No'

✅ Filter and show only the students who:

Passed the exam AND

Are from London

✅ Change Hamza’s score to 74

✅ Save the final DataFrame to a CSV file called "exam_results.csv"
(Don’t include the index!)


'''

In [113]:
'''
✅ Add a new column called "Passed":
Value should be 'Yes' if score ≥ 75, else 'No
'''
#(wrong code)df["outcome"] = ['Passed' if df['Score'] >= 75 else 'Failed']

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [115]:
df["outcome"] = df["Score"].apply(lambda x: 'Passed' if x >= 75 else 'Failed')

In [117]:
df.head()

     Name  Score        City outcome
0   Ayaan     85      London  Passed
1  Fatima     92  Birmingham  Passed
2    Zayd     76  Manchester  Passed
3  Maryam     89      London  Passed
4   Hamza     67       Leeds  Failed

In [119]:
passed_london = df[(df["outcome"]== "Passed") & (df["City"] == "London")]
print(passed_london)

     Name  Score    City outcome
0   Ayaan     85  London  Passed
3  Maryam     89  London  Passed

In [125]:
df.loc[4, "Score"] = 74

In [129]:
df.head()

     Name  Score        City outcome
0   Ayaan     85      London  Passed
1  Fatima     92  Birmingham  Passed
2    Zayd     76  Manchester  Passed
3  Maryam     89      London  Passed
4   Hamza     74       Leeds  Failed

In [131]:
df["Outcome"] =  df["Score"].apply(lambda x: 'Passed' if x >= 75 else 'Failed')

In [133]:
df.head()

     Name  Score        City outcome Outcome
0   Ayaan     85      London  Passed  Passed
1  Fatima     92  Birmingham  Passed  Passed
2    Zayd     76  Manchester  Passed  Passed
3  Maryam     89      London  Passed  Passed
4   Hamza     74       Leeds  Failed  Failed

In [139]:
df.to_csv('exam_results.csv', index=False)

exam_result = pd.read_csv('exam_results.csv')

In [141]:
exam_result

     Name  Score        City outcome Outcome
0   Ayaan     85      London  Passed  Passed
1  Fatima     92  Birmingham  Passed  Passed
2    Zayd     76  Manchester  Passed  Passed
3  Maryam     89      London  Passed  Passed
4   Hamza     74       Leeds  Failed  Failed

In [149]:
df.drop("outcome", axis=1)

     Name  Score        City Outcome
0   Ayaan     85      London  Passed
1  Fatima     92  Birmingham  Passed
2    Zayd     76  Manchester  Passed
3  Maryam     89      London  Passed
4   Hamza     74       Leeds  Failed

In [151]:
exam_result

     Name  Score        City outcome Outcome
0   Ayaan     85      London  Passed  Passed
1  Fatima     92  Birmingham  Passed  Passed
2    Zayd     76  Manchester  Passed  Passed
3  Maryam     89      London  Passed  Passed
4   Hamza     74       Leeds  Failed  Failed

In [153]:
exam_result.drop("outcome", axis=1)

     Name  Score        City Outcome
0   Ayaan     85      London  Passed
1  Fatima     92  Birmingham  Passed
2    Zayd     76  Manchester  Passed
3  Maryam     89      London  Passed
4   Hamza     74       Leeds  Failed